Тестовый/src/DataProcessors/ЗаполинтьТестовыйРегистр1/ЗаполинтьТестовыйРегистр1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполинтьТестовыйРегистр1</name>
</mdclass:DataProcessor>

Тестовый/src/InformationRegisters/ТестовыйРегистр/ТестовыйРегистр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТестовыйРегистр</name>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Склады</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовый/src/DataProcessors/ЗаполинтьТестовыйРегистр1/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.11.269");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Открыть обработку'");
	Команда.Идентификатор = "ОткрытиеФормы";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Выполнить обработку на сервере'");
	Команда.Идентификатор = "ВызовСерверногоМетода";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Ложь;

    Возврат ПараметрыРегистрации;
    
КонецФункции

Процедура ВыполнитьКоманду (Знач ИмяКоманды,Знач ПараметрВыполнения) Экспорт

	Если ИмяКоманды = "ВызовСерверногоМетода" Тогда
		ЗаполнитьРегистрНаСервере();
		ОчиститьРегистрНаСервере();
	КонецЕсли;	

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьРегистрНаСервере() Экспорт
	
	///РегистрыСведений.ТестовыйРегистр.ЗаполнитьРегистрТестовымиЗаписями();

	Записей = 100;
	
	НаборЗаписей = РегистрыСведений.ТестовыйРегистр.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Дата = ТекущаяДата();

	ГСЧисло = Новый ГенераторСлучайныхЧисел; 
	ГССтрока = Новый ГенераторСлучайныхПаролей;
	
	Для Запись = 0 по Записей Цикл;

		НоваяЗапись =  НаборЗаписей.Добавить();
		НоваяЗапись.Строка = ГССтрока.СлучайныйПароль(7);
		НоваяЗапись.Число = ГСЧисло.СлучайноеЧисло(1,99);
		НоваяЗапись.Дата = Дата;
		НоваяЗапись.ПометкаУдаления = ?(Запись%2=0,Истина,Ложь);
		
		Дата = Дата;//+1;
	КонецЦикла;	
	Попытка
		НачатьТранзакцию();
		
		НаборЗаписей.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Успешно записано "+Записей+" записей!";
		Сообщение.Сообщить();
		
		ЗафиксироватьТранзакцию();
	Исключение 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать "+Записей+" записей!";
		Сообщение.Сообщить();

	    ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры

Процедура ОчиститьРегистрНаСервере() Экспорт
	
	//РегистрыСведений.ТестовыйРегистр.ОчиститьРегистрОтТестовыхЗаписей();

	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТестовыйРегистр.Строка КАК Строка,
			|	ТестовыйРегистр.Число КАК Число,
			|	ТестовыйРегистр.Дата КАК Дата,
			|	ТестовыйРегистр.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	РегистрСведений.ТестовыйРегистр КАК ТестовыйРегистр
			|ГДЕ
			|	НЕ ТестовыйРегистр.Строка В
			|				(ВЫБРАТЬ
			|					Склады.Ссылка КАК Ссылка
			|				ИЗ
			|					Справочник.Склады КАК Склады)
			|	И ТИПЗНАЧЕНИЯ(ТестовыйРегистр.Строка) <> ТИП(СТРОКА)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Переменные = Новый Структура;
		Переменные.Вставить("МФЦПолюс","ООО ""МФЦ ПОЛЮС"""); 
		Переменные.Вставить("АДМ",Справочники.Подразделения.НайтиПоНаименованию("Администрация"));
		Переменные.Вставить("Логистика","ООО ""ПОЛЮС Логистика""");
		
		//Выборка = РезультатЗапроса.Выбрать();
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"Подразделение");
		Переменные.Свойство(Результат);
		Если Переменные.АДМ = Результат Тогда
			ОбщегоНазначения.СообщитьПользователю("Найдено",,,,);	
		КонецЕсли;	
		
		СчетчикТел = 0;
		Набор = РегистрыСведений.ТестовыйРегистр.СоздатьНаборЗаписей();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());
		Набор.Записать(РежимЗамещения.Удаление);
		
		Текст = СтрШаблон(Нстр("ru = 'Успешно удалено %1 записей!'"),СчетчикТел);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		ЗафиксироватьТранзакцию();
	Исключение 
		МенеджерОшибок = Новый МенеджерОбработкиОшибок;
		ТекстОшибки = МенеджерОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Ошибка удаления",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка удаления записей регистра сведений "+ТекстОшибки);
		ОтменитьТранзакцию();
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти
